YES = "Да"
NO = "Нет"
MONTH_STATISTICS = "Статистика за месяц"
CONSULTATIONS_IN_PROGRESS = "В работе"
VERDUE_CONSULTATIONS = "🔥 Cроки горят"
RULES = "Правила сервиса"


# conversation/authorization.py
GET_CONSULTATION = "Получить онлайн-консультацию"
SUPPORT_PROJECT = "Поддержать проект"


# conversation/menu.py
SET_TIMEZONE = "Настроить часовой пояс (сейчас {user_tz})"
MENU = "Меню"

# conversation/timezone.py
SEND_GEOLOCATION = "Отправить свою геолокацию для автоматической настройки часового пояса"
DEFAULT_TIMEZONE = "Таймзона по умолчанию UTC+03:00 (Москва)."
TIMEZONE_BY_LOCATION_OR_MANUAL = "Таймзона по локации или вручную."


# services/repeat_message.py
REMIND_IN_HOUR = "🕑 Напомнить через час"


# jobs.py
BILL_SENT = "✅ Уже отправил(а)"
BILL_WILL_SEND_SOON = "🕑 Скоро отправлю"


# menu_button.py
START = "Начать работу с ботом."
MENU2 = "Показать список возможных запросов."
