REMIND_IN_AN_HOUR_MESSAGE = "🕑 Напомнить через час"
REPEAT_AFTER_MINUTE_MESSAGE = "are you want to repeat after minute?"
YES_MESSAGE = "Да"
NO_MESSAGE = "Нет"
START_INVITE_AND_ASK_MESSAGE = (
    "Привет! Этот бот предназаначен только для экспертов справочной службы Просто спросить. Вы являетесь экспертом?"
)
NOT_EXPERT_ASK_MESSAGE = (
    "Этот бот предназаначен только для экспертов справочной службы 'Просто спросить'."
    "Хотите стать нашим экспертом и отвечать на заявки от пациентов и их близких?"
)
INVITE_NEW_EXPERT_MESSAGE = (
    "Мы всегда рады подключать к проекту новых специалистов! Здорово, что вы хотите работать с нами. Заполните,"
    "пожалуйста, эту анкету (нужно 15 минут). Команда сервиса подробно изучит вашу заявку и свяжется с вами в течение "
    "недели, чтобы договориться о видеоинтервью. Перед интервью мы можем попросить вас ответить на тестовый кейс,"
    "чтобы обсудить его на встрече. Желаем удачи :)"
)
NEW_EXPERT_ADDED_AND_SETUP_TIMEZONE_MESSAGE = (
    "Вы успешно начали работу с ботом. Меня зовут Женя Краб, я telegram-bot для экспертов справочной службы 'Просто "
    "спросить'. Я буду сообщать вам о новых заявках, присылать уведомления о новых сообщениях в чате от пациентов"
    "и их близких и напоминать о просроченных заявках. Нам нравится, что вы с нами. Не терпится увидеть вас в деле!"
    "Для начала, давайте настроим часовой пояс, чтобы вы получали уведомления в удобное время."
)
TIMEZONE_SETUP_FINISH_MESSAGE = "Вы настроили часовой пояс, теперь уведомления будут приходить в удобное время"
HOUSTON_WE_HAVE_A_PROBLEM_MESSAGE = "Хьюстон, у нас проблемы. Что-то пошло не так"
TIMEZONE_SETUP_MENU_MESSAGE = "⌚ Настроить часовой пояс"
MONTHLY_STATISTIC_MENU_MESSAGE = "📊 Статистика за месяц"
WEEKLY_STATISTIC_MENU_MESSAGE = "📈 Статистика за неделю"

MENU_MESSAGE = "Меню"
AT_WORK_MENU_MESSAGE = "📌 В работе"
OVERDUE_MENU_MESSAGE = "🔥 сроки горят"
SERVICE_RULES_MENU_MESSAGE = "📜 Правила сервиса"

START_CONVERSATION_NAME = "start_conversation"

BOT_STARTED_AND_WORKED_WEBHOOK_MESSAGE = "Бот запущен и работает. Сообщение получено по запросу на Api сервера %s"
SEND_TO_BOT_MESSAGE = "Message send to bot: %s"
