YES = """Да"""
NO = """Нет"""
GREETING = """
Привет!
Этот бот предназаначен только для экспертов справочной службы «Просто спросить».
Являетесь ли Вы нашим экспертом?
"""
WANT_TO_BECOME_AN_EXPERT = """
Желаете стать нашим экспертом и отвечать на заявки от пациентов и их близких?
"""
WE_EXITED_TO_ADD_YOU = """
Мы всегда рады подключать к проекту новых специалистов!
Здорово, что Вы хотите работать с нами.
Заполните,пожалуйста, эту анкету, это займёт всего 10-15 минут.
МЫ изучим Вашу заявку и свяжемся с Вами в течение недели, чтобы договориться о видеоинтервью.
Перед интервью мы можем попросить Вас ответить на тестовый кейс,чтобы обсудить его на встрече.
Желаем удачи :)
"""
AFTER_REGISTER = """
Вы успешно начали работу с ботом.
Меня имя Женя Краб и я telegram-bot для экспертов справочной службы «Просто спросить».
Я буду сообщать Вам о новых заявках, присылать уведомления о новых сообщениях в чате от пациентов и их близких.
И может быть напоминать о просроченных заявках.
Нам нравится, что Вы с нами. Не терпится увидеть Вас в деле!
Для начала, давайте настроим часовой пояс, чтобы Вы получалиуведомления в удобное время.
"""
TIMEZONE_HAS_BEEN_SET = """
Вы настроили часовой пояс, теперь уведомления будут приходить в удобное дл Вас время.
"""
HOUSTON = """
Хьюстон, у нас проблемы! Что-то пошло не так!
"""
